Revit 2024 API
FabricationServiceButton.ContainsFabricationPartType Method
 Checks to see if the fabrication part type exists on one of the button conditions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016 Subscription Release
Syntax
C#
public bool ContainsFabricationPartType(
	FabricationPartType partType
)
Visual Basic
Public Function ContainsFabricationPartType ( _
	partType As FabricationPartType _
) As Boolean
Visual C++
public:
bool ContainsFabricationPartType(
	FabricationPartType^ partType
)
Parameters
partType
Type: Autodesk.Revit.DB.FabricationPartType
 The fabrication part type to check.
Return Value
 Returns true if the fabrication part type exists on the fabrication service button.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FabricationServiceButton Class
Autodesk.Revit.DB Namespace